modm-io/modm/tests/stm32_p103/sd.cpp
	if (drv > 0) {
		XPCC_LOG_DEBUG << "  parameter error" << xpcc::endl;
		return STA_NOINIT; /* Supports only single drive */
	}
	if (globalDiskStatus & STA_NODISK) {
		XPCC_LOG_DEBUG << "  no card" << xpcc::endl;
		return globalDiskStatus; /* No card in the socket */
	}
	
	power_on(); /* Force socket power on and initialize interface */
	interface_speed(INTERFACE_SLOW);
	for (uint_fast8_t n = 10; n; n--)
		rcvr_spi(); /* 80 dummy clocks */
	
	uint8_t ty = 0;
	if (send_cmd(CMD0, 0) == 1)
	{
		/* Enter Idle state */
		
		Timer1 = 100; /* Initialization timeout of 1000 milliseconds */
		
		if (send_cmd(CMD8, 0x1AA) == 1)
		{
			XPCC_LOG_DEBUG << "  SDHC" << xpcc::endl;
			/* SDHC */
			for (uint_fast8_t n = 0; n < 4; n++)
				ocr[n] = rcvr_spi(); /* Get trailing return value of R7 response */
			
			if (ocr[2] == 0x01 && ocr[3] == 0xAA)
			{
				/* The card can work at VDD range of 2.7-3.6V */
				while (Timer1 && send_cmd(ACMD41, 1UL << 30)) {
					/* Wait for leaving idle state (ACMD41 with HCS bit) */
				}
				if (Timer1 && send_cmd(CMD58, 0) == 0)
				{ /* Check CCS bit in the OCR */
					for (uint_fast8_t n = 0; n < 4; n++)
						ocr[n] = rcvr_spi();
					ty = (ocr[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;
				}
			}
		}
		else
		{
			/* SDSC or MMC */
			uint8_t cmd;
			if (send_cmd(ACMD41, 0) <= 1)
			{
				ty = CT_SD1;
				cmd = ACMD41; /* SDSC */
				XPCC_LOG_DEBUG << "  SDSC" << xpcc::endl;
			}
			else
			{
				ty = CT_MMC;
				cmd = CMD1; /* MMC */
				XPCC_LOG_DEBUG << "  MMC" << xpcc::endl;
			}
			while (Timer1 && send_cmd(cmd, 0)) {
				// Wait for leaving idle state
			}
			if (!Timer1 || send_cmd(CMD16, 512) != 0) /* Set R/W block length to 512 */
				ty = 0;
		}
	}
	CardType = ty;
	release_spi();
	
	if (ty)
	{
		XPCC_LOG_DEBUG << "  success" << xpcc::endl;
		
		/* Initialization succeeded */
		globalDiskStatus &= ~STA_NOINIT; /* Clear STA_NOINIT */
		interface_speed(INTERFACE_FAST);
	}
	else
	{
		XPCC_LOG_DEBUG << "  failed" << xpcc::endl;
		
		/* Initialization failed */
		power_off();
	}
	
	return globalDiskStatus;
}



/*-----------------------------------------------------------------------*/
/* Get Disk Status                                                       */
/*-----------------------------------------------------------------------*/

DSTATUS disk_status (
	BYTE drv		/* Physical drive number (0) */
)
{
	XPCC_LOG_DEBUG << "disk_status " << xpcc::endl;
	
	if (drv > 0) {
		return STA_NOINIT;		/* Supports only single drive */
	}
	
	XPCC_LOG_DEBUG << "  status=" << globalDiskStatus << xpcc::endl;
	return globalDiskStatus;
}



/*-----------------------------------------------------------------------*/
/* Read Sector(s)                                                        */
/*-----------------------------------------------------------------------*/

DRESULT disk_read (
	BYTE drv,			/* Physical drive number (0) */
	BYTE *buff,			/* Pointer to the data buffer to store read data */
	DWORD sector,		/* Start sector number (LBA) */
	BYTE count			/* Sector count (1..255) */
)
{
	XPCC_LOG_DEBUG << "disk_read sector=" << sector << ", count=" << count << xpcc::endl;
	
	if ((drv > 0) || (count == 0)) {
		XPCC_LOG_DEBUG << "  failed - parameter error" << xpcc::endl;
		return RES_PARERR;
	}
	if (globalDiskStatus & STA_NOINIT) {
		XPCC_LOG_DEBUG << "  failed - not ready, status=" << globalDiskStatus << xpcc::endl;
		return RES_NOTRDY;
	}
	
	if (!(CardType & CT_BLOCK)) {
		// Convert to byte address if needed
		sector *= 512;
	}

	if (count == 1)
	{
		/* Single block read */
		if (send_cmd(CMD17, sector) == 0)	{ /* READ_SINGLE_BLOCK */
			if (rcvr_datablock(buff, 512)) {
				count = 0;
			}
		}
	}
	else
	{
		// Multiple block read
		if (send_cmd(CMD18, sector) == 0)
		{
			// READ_MULTIPLE_BLOCK
			do {
				if (!rcvr_datablock(buff, 512)) {
					break;
				}
				buff += 512;
			} while (--count);
			send_cmd(CMD12, 0);				/* STOP_TRANSMISSION */
		}
	}
	release_spi();
	
	if (count == 0) {
		XPCC_LOG_DEBUG << "  success" << xpcc::endl;
	}
	else {
		XPCC_LOG_DEBUG << "  failed" << xpcc::endl;
	}
	
	return ((count != 0) ? RES_ERROR : RES_OK);
}



/*-----------------------------------------------------------------------*/
/* Write Sector(s)                                                       */
/*-----------------------------------------------------------------------*/

DRESULT disk_write (
	BYTE drv,			/* Physical drive number (0) */
	const BYTE *buff,	/* Pointer to the data to be written */
	DWORD sector,		/* Start sector number (LBA) */
	BYTE count			/* Sector count (1..255) */
)
{
	XPCC_LOG_DEBUG << "disk_write" << xpcc::endl;
	
	if (drv || !count)		return RES_PARERR;
	if (globalDiskStatus & STA_NOINIT)	return RES_NOTRDY;
	if (globalDiskStatus & STA_PROTECT)	return RES_WRPRT;
	
	if (!(CardType & CT_BLOCK))
		sector *= 512; /* Convert to byte address if needed */
	
	if (count == 1)
	{ /* Single block write */
		if ((send_cmd(CMD24, sector) == 0) /* WRITE_BLOCK */
		&& xmit_datablock(buff, 0xFE))
			count = 0;
	}
	else
	{ /* Multiple block write */
		if (CardType & CT_SDC)
			send_cmd(ACMD23, count);
		if (send_cmd(CMD25, sector) == 0)
		{ /* WRITE_MULTIPLE_BLOCK */
			do
			{
				if (!xmit_datablock(buff, 0xFC))
					break;
				buff += 512;
			} while (--count);
			if (!xmit_datablock(0, 0xFD)) /* STOP_TRAN token */
				count = 1;
		}
	}
	release_spi();
	
	return count ? RES_ERROR : RES_OK;
}

/*-----------------------------------------------------------------------*/
/* Miscellaneous Functions                                               */
/*-----------------------------------------------------------------------*/

DRESULT disk_ioctl (
	BYTE drv,		/* Physical drive number (0) */
	BYTE ctrl,		/* Control code */
	void *buff		/* Buffer to send/receive control data */
)
{
	XPCC_LOG_DEBUG << "disk_ioctl" << xpcc::endl;
	
	DRESULT res;
	BYTE n, csd[16], *ptr = reinterpret_cast<BYTE *>(buff);
	WORD csize;

	if (drv) return RES_PARERR;

	res = RES_ERROR;

	if (ctrl == CTRL_POWER) {
		switch (*ptr) {
		case 0:		/* Sub control code == 0 (POWER_OFF) */
			if (chk_power())
				power_off();		/* Power off */
			res = RES_OK;
			break;
		case 1:		/* Sub control code == 1 (POWER_ON) */
			power_on();				/* Power on */
			res = RES_OK;
			break;
		case 2:		/* Sub control code == 2 (POWER_GET) */
			*(ptr+1) = (BYTE)chk_power();
			res = RES_OK;
			break;
		default :
			res = RES_PARERR;
		}
	}
	else {
		if (globalDiskStatus & STA_NOINIT) return RES_NOTRDY;

		switch (ctrl) {
		case CTRL_SYNC :		/* Make sure that no pending write process */
			SELECT();
			if (wait_ready() == 0xFF)
				res = RES_OK;
			break;

